app/views/dashboard/dashboard.html.erb

	<h5> Visitors per Day</h5>
		<%= line_chart Visit.group_by_day(:started_at).count %>
---
SELECT COUNT(*) AS count_all, DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(started_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d 00:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second) AS date_add_convert_tz_date_format_convert_tz_date_sub_started_at_interval_0_second_00_00_etc_utc_y_m_d_00_00_00_etc_utc_00_00_interval_0_second FROM `visits` WHERE (started_at IS NOT NULL) GROUP BY DATE_ADD(CONVERT_TZ(DATE_FORMAT(CONVERT_TZ(DATE_SUB(started_at, INTERVAL 0 second), '+00:00', 'Etc/UTC'), '%Y-%m-%d 00:00:00'), 'Etc/UTC', '+00:00'), INTERVAL 0 second)

	<h5> Visitors Category</h5>
		<%= column_chart Ahoy::Event.group(:name).count %>
---
SELECT COUNT(*) AS count_all, (DATE_TRUNC('day', (started_at::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC' AS date_trunc_day_started_at_timestamptz_interval_0_second_at_time FROM "ahoy_events" WHERE "ahoy_events"."name" = $1 AND (started_at IS NOT NULL) GROUP BY (DATE_TRUNC('day', (started_at::timestamptz - INTERVAL '0 second') AT TIME ZONE 'Etc/UTC') + INTERVAL '0 second') AT TIME ZONE 'Etc/UTC'  [["name", "Viewed gadget_news"]]