app/views/articles/_form.html.erb

SELECT `categories`.* FROM `categories` ORDER BY `categories`.`name` ASC
---
  <%= form.label :category_id %>
  <%= form.collection_select :category_id, Category.order(:name),:id,:name, include_blank: true, class: "form-control" %>