app/views/articles/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."article_id" = $1  [["article_id", 4]]
---
    <div class="container" style="padding-bottom: 50px; padding-top: 50px;" align="right">
      <% @article.tags.each do |tag| %>