app/controllers/articles_controller.rb

INSERT INTO "articles" ("text", "content", "created_at", "updated_at", "avatar", "category_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["text", "test 1"], ["content", "<p>test 1&nbsp;</p>\r\n"], ["created_at", "2017-09-15 11:53:07.969182"], ["updated_at", "2017-09-15 11:53:07.969182"], ["avatar", "acidbg.png"], ["category_id", 3]]
---
  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "avatar" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["avatar", "apple-091217-iphone-x-4125.jpg"], ["updated_at", "2017-09-15 12:36:18.637482"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)