app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "qweqweqweqweqw"], ["created_at", "2017-09-15 02:17:10.659390"], ["updated_at", "2017-09-15 02:17:10.659390"]]