app/controllers/comments_controller.rb

INSERT INTO "comments" ("email", "name", "body", "article_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["email", "qweqw"], ["name", "qwe"], ["body", "qwe"], ["article_id", 1], ["created_at", "2017-09-14 02:13:01.374409"], ["updated_at", "2017-09-14 02:13:01.374409"]]
---
  def create
   @comment = Comment.new(comment_params)
  @comment.article_id = params[:article_id]
  @comment.email = params[:email]


  @comment.save