app/controllers/newsletters_controller.rb

  def index
    @newsletters = Newsletter.all
---
SELECT "newsletters".* FROM "newsletters"

  def create
    @newsletter = Newsletter.new(newsletter_params)

    respond_to do |format|
      if @newsletter.save
---
INSERT INTO "newsletters" ("email", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["email", "12312312"], ["created_at", "2017-09-23 00:47:09.851245"], ["updated_at", "2017-09-23 00:47:09.851245"]]

    def set_newsletter
      @newsletter = Newsletter.find(params[:id])
---
SELECT  "newsletters".* FROM "newsletters" WHERE "newsletters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]