app/controllers/static_controller.rb

SELECT "articles".* FROM "articles"
SELECT "taggings".* FROM "taggings" WHERE "taggings"."tag_id" = $1  [["tag_id", 6]]
SELECT "tags".* FROM "tags"
SELECT "categories".* FROM "categories"
---
def index
	 @articles = Article.all
	 @taggings = Tagging.all
	 @tags = Tag.all
	 @categories = Category.all